import { Prisma, PrismaClient } from '@prisma/client';
import { slugify } from '../../src/common/helpers/slugify';
const prisma = new PrismaClient();

/* -------------------------------------------------------------------------- */
/*                                    SEED                                    */
/* -------------------------------------------------------------------------- */
const contentCategories = (): Prisma.ContentCategoryCreateInput[] => {
  const data: Prisma.ContentCategoryCreateInput[] = [
    {
      title: 'بلاگ',
      slug: slugify('بلاگ'),
      key: 'blog',
    },
    {
      title: 'تماس با ما',
      slug: slugify('تماس با ما'),
      key: 'contactUs',
    },
    {
      title: 'سوالات متداول',
      slug: slugify('سوالات متداول'),
      key: 'faq',
    },
    {
      title: 'متــن های ثابت هــدر',
      slug: slugify('متــن های ثابت هــدر'),
      key: 'mainPageTopFix',
      dynamic_fields: [
        { key: 'bgHexColor', type: 'text', title: 'رنگ بک گراند' },
        { key: 'textHexCode', type: 'text', title: 'رنگ نوشته' },
      ],
    },
  ];

  return data;
};

const contents = (): Prisma.ContentUncheckedCreateInput[] => {
  const data: Prisma.ContentUncheckedCreateInput[] = [
    {
      title: 'درباره ما',
      key: 'aboutUs',
      html: `<p><span style="font-size: 18pt;"><strong>درباره ما</strong></span></p>
      <p style="text-align: center;"><span style="color: rgb(224, 62, 45);">متن از پنل مدیریت</span></p>
      <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده</p>
      <p>، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای</p>
      <p>&nbsp;اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. HTML</p>`,
      is_active: true,
    },
    {
      title: 'قوانین و مقررات',
      key: 'terms',
      html: `<h2>قانون یک:&nbsp;</h2>
      <p>ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان ف</p>
      <h2>قانون دو:&nbsp;</h2>
      <p>ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و لوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان ف</p>
      <p>&nbsp;</p>
      <h2>قانون سه :</h2>
      <p>ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولو</p>`,
      is_active: true,
    },
    {
      title: 'تلفن ثابت',
      key: 'tel',
      small_text: '02188230063',
      category_id: 2, //contactus
      is_active: true,
    },
    {
      title: 'آدرس',
      key: 'address',
      small_text: 'تهران سعادت آباد بلوار دریا پلاک ۵۷ واحد ۵',
      full_text: '35.5501,51.515',
      category_id: 2, //contactus
      is_active: true,
    },
    {
      title: 'اینستاگرام',
      key: 'social',
      small_text: 'https://instagram.com/kiantc',
      category_id: 2,
      is_active: true,
    },
    {
      title: 'واتساپ',
      key: 'social',
      small_text: 'https://wa.me?q=+98912',
      category_id: 2,
      is_active: true,
    },
    {
      title: 'ایا نمایندگی رسمی هستید؟',
      key: '',
      small_text: 'بله ما نماینده رسمی فروش و خدمات هستیم',
      category_id: 3, //faq
      is_active: true,
    },
    {
      title: 'سوال دو؟',
      key: '',
      small_text: 'پاسخ سوال دو پاسخ سوال دو پاسخ سوال دو پاسخ سوال دو پاسخ سوال دو ',
      category_id: 3, //faq
      is_active: true,
    },
    {
      title: 'تصویر مهر برای فاکتور',
      slug: slugify('تصویر مهر برای فاکتور'),
      key: 'invoiceStamp',
      small_text: '',
      category_id: null,
      is_active: true,
    },
  ];

  return data;
};

/* -------------------------------------------------------------------------- */
/*                                   CREATE                                   */
/* -------------------------------------------------------------------------- */
export async function contentSeeder(): Promise<void> {
  console.time('✅ CONTENTS');
  for (const e of contentCategories()) {
    await prisma.contentCategory.upsert({ where: { key: e.key }, update: e, create: e });
  }
  for (const e of contents()) {
    const isDuplicate = await prisma.content.findFirst({ where: { title: e.title } });
    if (isDuplicate) await prisma.content.update({ where: { id: isDuplicate.id }, data: e });
    else await prisma.content.create({ data: e });
  }
  console.timeEnd('✅ CONTENTS');
}
